Repository: NaN-tic/trytond-purchase_edi
Catalog: locale/*.po
Languages: ca, es_es

# error:purchase.purchase:
source: Missing EDI EAN Warehouse code from address ID:"%s"
es_es: Falta el código EAN EDI del almacén para la dirección ID:"%s"

# error:purchase.purchase:
source: Missing EDI Operational Point from party "%s"
es_es: Falta el Punto Operacional EDI para el tercero "%s".

# error:purchase.purchase:
source: Path location "%s" doesn't exists
es_es: El directorio "%s" no existe

# error:purchase.purchase:
source: Resend purchase "%(purchase)s"?
es_es: Renviar la compra "%(purchase)s"?

# field:purchase.purchase,edi_message_function:
source: Message Function
ca: Funció del missatge
es_es: Función del mensaje

# field:purchase.purchase,edi_order_type:
source: Document Type
ca: Tipus de document
es_es: Tipo de documento

# field:purchase.purchase,edi_special_condition:
source: Special conditions, codified
ca: Condicions especials, codificat
es_es: Condiciones especiales, codificado

# field:purchase.purchase,edi_state:
source: EDI Communication State
ca: Estat de la comunicació
es_es: Estado de Comunicación

# field:purchase.purchase,resend_edi:
source: Resend Purchase
es_es: Reenviar la compra

# field:purchase.purchase,sended_on:
source: Sended On
ca: Data enviament
es_es: Fecha de envio

# field:purchase.purchase,supplier_edi_operational_point:
source: Supplier EDI Operational Point
ca: Punt Operacional EDI del Proveïdor
es_es: Punto Operacional EDI del Proveedor

# field:purchase.purchase,use_edi:
source: Use EDI
ca: Utilitza EDI
es_es: Utiliza EDI

# help:purchase.purchase,edi_state:
source: State of the EDI communication
ca: Estat de la comunicació EDI
es_es: Estado de la comunicacion EDI

# help:purchase.purchase,resend_edi:
source: Resend again when purchase is confirmed
es_es: Reenviar cuando la compra se confirme.

# help:purchase.purchase,use_edi:
source: Use EDI protocol for this purchase
ca: Utilitzar el protocol EDI per aquesta compra
es_es: Usa el protocolo EDI para esta compra

# model:ir.cron,name:cron_update_edi_orders_state
source: Update EDI Orders
ca: Actualitzar Ordres EDI
es_es: Actualizar ordenes EDI

# model:res.user,name:user_edi_orders
source: Cron EDI Orders
ca: Cron de Ordres EDI
es_es: Cron Ordenes EDI

# selection:purchase.purchase,edi_message_function:
source: Cancellation
ca: Cancelació
es_es: Cancelación

# selection:purchase.purchase,edi_message_function:
source: Copy
ca: Còpia
es_es: Copia

# selection:purchase.purchase,edi_message_function:
source: Modification
ca: Modificació
es_es: Modificación

# selection:purchase.purchase,edi_message_function:
source: Replacement
ca: Reemplaçament
es_es: Reemplazo

# selection:purchase.purchase,edi_order_type:
source: Normal Order
ca: Comanda Normal
es_es: Pedido Normal

# selection:purchase.purchase,edi_order_type:
source: Partial order that cancels an open order
ca: Comanda parcial que cancel·la una altra comanda
es_es: Pedido parcial que cancela un pedido abierto.

# selection:purchase.purchase,edi_special_condition:
source: Bill but not re-supply
ca: Facturar pero no re-proveir
es_es: Facturar pero no reabastecer

# selection:purchase.purchase,edi_special_condition:
source: Deliver the entire order
ca: Entregar la comanda sencera
es_es: Entregar el pedido entero

# selection:purchase.purchase,edi_special_condition:
source: Send but not invoice
ca: Enviar però no facturar
es_es: Enviar pero no facturar

# selection:purchase.purchase,edi_state:
source: Answered
ca: Respost
es_es: Respondido

# selection:purchase.purchase,edi_state:
source: None
ca: Cap
es_es: Ninguno

# selection:purchase.purchase,edi_state:
source: Pending
ca: Pendent
es_es: Pendiente

# selection:purchase.purchase,edi_state:
source: Sended
ca: Enviat
es_es: Enviado

# selection:purchase.purchase,resend_edi:
source: No Resend
es_es: No reenviar

# selection:purchase.purchase,resend_edi:
source: Resend
es_es: Reenviar

# view:purchase.purchase:
source: Outgoing Message
ca: Missatge de sortida
es_es: Mensaje saliente

# error:purchase.purchase:
source: Missing EDI EAN Warehouse code from address ID:"%(address)s"
ca: Falta el codi EAN de EDI per l'adreça ID: "%(address)s"

# error:purchase.purchase:
source: Missing EDI Operational Point from party "%(party)s"
ca: Falta el Punt Operacional EDI per el tercer "%(party)s".

# error:purchase.purchase:
source: Path location "%(path)s" doesn't exists
ca: El directori "%(path)s" no existeix

# error:purchase.purchase:
source: The product with code "%(product)s" hasn't EAN13 code
ca: El producte amb codi "%(product)s" no té codi EAN13
